alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "adc.h"
#include "crc.h"
#include "dcmi.h"
#include "dma.h"
#include "dma2d.h"
#include "eth.h"
#include "fatfs.h"
#include "i2c.h"
#include "ltdc.h"
#include "quadspi.h"
#include "rtc.h"
#include "sai.h"
#include "sdmmc.h"
#include "spdifrx.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "usb_host.h"
#include "gpio.h"
#include "fmc.h"
#include "app_touchgfx.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32746g_discovery_audio.h"
#include <stdio.h>
#include <string.h>
#include <math.h>
#include "ff.h"
#include "arm_math.h"
#include "audio_equalizer.h"
#include "audio_echo.h"
#include "audio_reverb.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
FATFS SDFatFs;

#define AUDIO_BUFFER_SIZE   8192
#define AUDIO_HALF_BUFFER   (AUDIO_BUFFER_SIZE / 2)
FIL WavFile;
uint8_t AudioBuffer[AUDIO_BUFFER_SIZE];
volatile uint32_t AudioRemainingBytes = 0;
volatile uint8_t  AudioPlaying = 0;
volatile uint8_t  HalfBufferNeedsFill = 0;
volatile uint8_t  FullBufferNeedsFill = 0;
volatile uint8_t AudioTrackFinished = 0;
volatile uint8_t EQEnabled = 1;
volatile uint8_t NoiseReductionEnabled = 0;
volatile uint8_t noiseReductionResetPending = 0;

extern volatile uint8_t AudioVolume;

#define FFT_SIZE 1024
#define FFT_BANDS 16
#define EQ_LIMITER_THRESHOLD 32000.0f
#define EQ_LIMITER_RELEASE 0.05f

#define NR_FRAME_SIZE 512U
#define NR_HOP_SIZE (NR_FRAME_SIZE / 2U)
#define NR_BIN_COUNT (NR_FRAME_SIZE / 2U + 1U)
#define NR_INIT_FRAMES 12U
#define NR_OVERSUBTRACTION 2.0f
#define NR_MIN_GAIN 0.08f
#define NR_NOISE_SMOOTHING 0.97f
#define NR_GAIN_SMOOTHING 0.60f
#define NR_NOISE_UPDATE_RATIO 2.5f
#define NR_EPSILON 1.0e-12f

float32_t fftBands[FFT_BANDS];
float32_t fftBandsSmoothed[FFT_BANDS];
float32_t fftInput[FFT_SIZE];
float32_t fftOutput[FFT_SIZE];
float32_t fftMagnitude[FFT_SIZE / 2];
float32_t hannWindow[FFT_SIZE];

typedef struct
{
    float32_t inputFrame[NR_FRAME_SIZE];
    float32_t outputOverlap[NR_FRAME_SIZE];
    float32_t noisePower[NR_BIN_COUNT];
    float32_t previousGain[NR_BIN_COUNT];
    uint32_t initFrameCount;
} NoiseReductionChannel;

static NoiseReductionChannel nrLeft;
static NoiseReductionChannel nrRight;
static float32_t nrWindow[NR_FRAME_SIZE];
static float32_t nrFftInput[NR_FRAME_SIZE];
static float32_t nrFftOutput[NR_FRAME_SIZE];
static float32_t nrCurrentGain[NR_BIN_COUNT];

float32_t eqLimiterGain = 1.0f;
float32_t eqLeftBuffer[EQ_BLOCK_SIZE];
float32_t eqRightBuffer[EQ_BLOCK_SIZE];

arm_rfft_fast_instance_f32 fftInstance;
arm_rfft_fast_instance_f32 nrFftInstance;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
void MX_FREERTOS_Init(void);
/* USER CODE BEGIN PFP */
static void SDRAM_Initialization_Sequence(SDRAM_HandleTypeDef *hsdram);

uint8_t WavPlayer_Start(const char *filename);
void WavPlayer_FillHalf(uint8_t *half);

void AudioFFT_Process(uint8_t *audioData);

void AudioEQ_Process(uint8_t *audioData);
void AudioNoiseReduction_SetEnabled(uint8_t enabled);
uint8_t AudioNoiseReduction_IsEnabled(void);
static void AudioEQ_ApplyLimiter(void);
static void AudioNoiseReduction_Init(void);
static void AudioNoiseReduction_Reset(void);
static void AudioNoiseReduction_Process(void);
static void AudioNoiseReduction_ProcessChannel(
    NoiseReductionChannel *channel,
    float32_t *samples
);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC3_Init();
  MX_CRC_Init();
  MX_DCMI_Init();
  MX_DMA2D_Init();
  MX_ETH_Init();
  MX_FMC_Init();
  SDRAM_Initialization_Sequence(&hsdram1);
  MX_I2C1_Init();
  MX_I2C3_Init();
  MX_LTDC_Init();
  HAL_GPIO_WritePin(GPIOI, GPIO_PIN_12, GPIO_PIN_SET); // LCD_DISP
  HAL_GPIO_WritePin(GPIOK, GPIO_PIN_3, GPIO_PIN_SET);  // Backlight

  SCB_CleanDCache_by_Addr((uint32_t *)0xC0000000, 480 * 272 * 2);
  __DSB();
  __ISB();

  HAL_LTDC_SetAddress(&hltdc, 0xC0000000, LTDC_LAYER_1);
  HAL_LTDC_Reload(&hltdc, LTDC_RELOAD_IMMEDIATE);
  MX_QUADSPI_Init();
  MX_RTC_Init();
  MX_SAI2_Init();
  MX_SDMMC1_SD_Init();
  MX_SPDIFRX_Init();
  MX_SPI2_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM5_Init();
  MX_TIM8_Init();
  MX_TIM12_Init();
  MX_USART1_UART_Init();
  MX_USART6_UART_Init();
  MX_FATFS_Init();
  MX_TouchGFX_Init();
  /* Call PreOsInit function */
  MX_TouchGFX_PreOSInit();
  /* USER CODE BEGIN 2 */
  if (arm_rfft_fast_init_f32(&fftInstance, FFT_SIZE) != ARM_MATH_SUCCESS)
  {
      printf("FFT init failed\r\n");
      Error_Handler();
  }
  for (uint32_t i = 0; i < FFT_SIZE; i++)
  {
      hannWindow[i] =
          0.5f *
          (1.0f -
           cosf((2.0f * PI * i) / (FFT_SIZE - 1)));
  }
  /* USER CODE END 2 */

