alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
  /* Call init function for freertos objects (in cmsis_os2.c) */
  MX_FREERTOS_Init();

  /* Start scheduler */
  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure LSE Drive Capability
  */
  HAL_PWR_EnableBkUpAccess();

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 400;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Activate the Over-Drive mode
  */
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_6) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief Peripherals Common Clock Configuration
  * @retval None
  */
void PeriphCommonClock_Config(void)
{
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

  /** Initializes the peripherals clock
  */
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LTDC|RCC_PERIPHCLK_SAI2
                              |RCC_PERIPHCLK_SDMMC1|RCC_PERIPHCLK_CLK48;
  PeriphClkInitStruct.PLLSAI.PLLSAIN = 384;
  PeriphClkInitStruct.PLLSAI.PLLSAIR = 5;
  PeriphClkInitStruct.PLLSAI.PLLSAIQ = 2;
  PeriphClkInitStruct.PLLSAI.PLLSAIP = RCC_PLLSAIP_DIV8;
  PeriphClkInitStruct.PLLSAIDivQ = 1;
  PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_8;
  PeriphClkInitStruct.Sai2ClockSelection = RCC_SAI2CLKSOURCE_PLLSAI;
  PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48SOURCE_PLLSAIP;
  PeriphClkInitStruct.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_CLK48;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */
static void SDRAM_Initialization_Sequence(SDRAM_HandleTypeDef *hsdram)
{
    FMC_SDRAM_CommandTypeDef Command;
    uint32_t modeRegister;

    /* Step 1: Enable SDRAM clock */
    Command.CommandMode = FMC_SDRAM_CMD_CLK_ENABLE;
    Command.CommandTarget = FMC_SDRAM_CMD_TARGET_BANK1;
    Command.AutoRefreshNumber = 1;
    Command.ModeRegisterDefinition = 0;

    if (HAL_SDRAM_SendCommand(hsdram, &Command, 0xFFFF) != HAL_OK)
    {
        Error_Handler();
    }

    /* Step 2: At least 100 us delay */
    HAL_Delay(1);

    /* Step 3: Precharge all */
    Command.CommandMode = FMC_SDRAM_CMD_PALL;
    Command.CommandTarget = FMC_SDRAM_CMD_TARGET_BANK1;
    Command.AutoRefreshNumber = 1;
    Command.ModeRegisterDefinition = 0;

    if (HAL_SDRAM_SendCommand(hsdram, &Command, 0xFFFF) != HAL_OK)
    {
        Error_Handler();
    }

    /* Step 4: Auto refresh */
    Command.CommandMode = FMC_SDRAM_CMD_AUTOREFRESH_MODE;
    Command.CommandTarget = FMC_SDRAM_CMD_TARGET_BANK1;
    Command.AutoRefreshNumber = 8;
    Command.ModeRegisterDefinition = 0;

    if (HAL_SDRAM_SendCommand(hsdram, &Command, 0xFFFF) != HAL_OK)
    {
        Error_Handler();
    }

    /*
     * Step 5: Load Mode Register
     * CubeMX FMC setting = CAS Latency 3
     */
    modeRegister =
          0x0000U       /* Burst length 1 */
        | 0x0000U       /* Sequential */
        | 0x0030U       /* CAS latency 3 */
        | 0x0000U       /* Standard operating mode */
        | 0x0200U;      /* Single write burst */

    Command.CommandMode = FMC_SDRAM_CMD_LOAD_MODE;
    Command.CommandTarget = FMC_SDRAM_CMD_TARGET_BANK1;
    Command.AutoRefreshNumber = 1;
    Command.ModeRegisterDefinition = modeRegister;

    if (HAL_SDRAM_SendCommand(hsdram, &Command, 0xFFFF) != HAL_OK)
    {
        Error_Handler();
    }

    /* Step 6: Refresh rate for 100 MHz SDRAM clock */
    if (HAL_SDRAM_ProgramRefreshRate(hsdram, 0x0603) != HAL_OK)
    {
        Error_Handler();
    }
}

int __io_putchar(int ch)
{
  HAL_UART_Transmit(&huart1, (uint8_t *)&ch, 1, HAL_MAX_DELAY);
  return ch;
}

int _write(int file, char *ptr, int len)
{
  HAL_UART_Transmit(&huart1, (uint8_t *)ptr, len, HAL_MAX_DELAY);
  return len;
}

void WavPlayer_FillHalf(uint8_t *half)
{
  UINT bytesread = 0;

  if (!AudioPlaying)
    return;

  if (AudioRemainingBytes > 0)
  {
    UINT toRead = (AudioRemainingBytes < AUDIO_HALF_BUFFER) ? AudioRemainingBytes : AUDIO_HALF_BUFFER;
    f_read(&WavFile, half, toRead, &bytesread);
    AudioRemainingBytes -= bytesread;

    if (bytesread < AUDIO_HALF_BUFFER)
    {
      memset(&half[bytesread], 0, AUDIO_HALF_BUFFER - bytesread);
    }
  }
  else
  {
      memset(half, 0, AUDIO_HALF_BUFFER);

      AudioPlaying = 0;
      HalfBufferNeedsFill = 0;
      FullBufferNeedsFill = 0;

      f_close(&WavFile);

      AudioTrackFinished = 1;

      printf("Playback finished!\r\n");
  }
}

void WavPlayer_Stop(void)
{
    if (AudioPlaying)
    {
        BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);

        AudioPlaying = 0;

        HalfBufferNeedsFill = 0;
        FullBufferNeedsFill = 0;

        f_close(&WavFile);

        printf("Playback stopped\r\n");
    }
}

void BSP_AUDIO_OUT_HalfTransfer_CallBack(void)
{
  HalfBufferNeedsFill = 1;
}

void BSP_AUDIO_OUT_TransferComplete_CallBack(void)
{
  FullBufferNeedsFill = 1;
}

uint8_t WavPlayer_Start(const char *filename)
{
  FRESULT res;
  UINT bytesread;
  uint8_t audio_status;
  char chunkId[4];
  uint32_t chunkSize;

  AudioPlaying = 0;
  HalfBufferNeedsFill = 0;
  FullBufferNeedsFill = 0;
  AudioTrackFinished = 0;

  printf("Opening file %s...\r\n", filename);
  res = f_open(&WavFile, filename, FA_READ);
  if (res != FR_OK)
  {
    printf("f_open failed, res=%d\r\n", res);
    return 0;
  }
  printf("File opened OK\r\n");

  /* Read RIFF header (12 bytes total: "RIFF" + size(4) + "WAVE") */
  char riff[4], wave[4];
  uint32_t riffSize;
  f_read(&WavFile, riff, 4, &bytesread);
  f_read(&WavFile, &riffSize, 4, &bytesread);
  f_read(&WavFile, wave, 4, &bytesread);

  if (strncmp(riff, "RIFF", 4) != 0 || strncmp(wave, "WAVE", 4) != 0)
  {
    printf("Invalid WAV file (bad RIFF/WAVE header)!\r\n");
    f_close(&WavFile);
    return 0;
  }
  printf("RIFF/WAVE header OK\r\n");

