alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
  uint8_t foundFmt = 0, foundData = 0;
  uint16_t audioFormat = 0, numChannels = 0, bitsPerSample = 0, blockAlign = 0;
  uint32_t sampleRate = 0, byteRate = 0;
  uint32_t dataSize = 0;

  /* Walk chunks until we find both "fmt " and "data" */
  while (!foundData)
  {
    res = f_read(&WavFile, chunkId, 4, &bytesread);
    if (res != FR_OK || bytesread != 4)
    {
      printf("Failed to read chunk id (EOF before data chunk found)\r\n");
      f_close(&WavFile);
      return 0;
    }

    res = f_read(&WavFile, &chunkSize, 4, &bytesread);
    if (res != FR_OK || bytesread != 4)
    {
      printf("Failed to read chunk size\r\n");
      f_close(&WavFile);
      return 0;
    }

    printf("Found chunk '%.4s' size=%lu\r\n", chunkId, (unsigned long)chunkSize);

    if (strncmp(chunkId, "fmt ", 4) == 0)
    {
      FSIZE_t fmtChunkStart = f_tell(&WavFile);

      f_read(&WavFile, &audioFormat, 2, &bytesread);
      f_read(&WavFile, &numChannels, 2, &bytesread);
      f_read(&WavFile, &sampleRate, 4, &bytesread);
      f_read(&WavFile, &byteRate, 4, &bytesread);
      f_read(&WavFile, &blockAlign, 2, &bytesread);
      f_read(&WavFile, &bitsPerSample, 2, &bytesread);

      f_lseek(&WavFile, fmtChunkStart + chunkSize);
      foundFmt = 1;
    }
    else if (strncmp(chunkId, "data", 4) == 0)
    {
      dataSize = chunkSize;
      foundData = 1;
    }
    else
    {
      FSIZE_t currentPos = f_tell(&WavFile);
      f_lseek(&WavFile, currentPos + chunkSize);
    }
  }

  if (!foundFmt)
  {
    printf("No fmt chunk found!\r\n");
    f_close(&WavFile);
    return 0;
  }

  printf("AudioFormat=%u NumChannels=%u SampleRate=%lu BitsPerSample=%u DataSize=%lu\r\n",
         audioFormat, numChannels, (unsigned long)sampleRate, bitsPerSample, (unsigned long)dataSize);

  if (audioFormat != 1)
  {
    printf("Not PCM format!\r\n");
    f_close(&WavFile);
    return 0;
  }

  AudioRemainingBytes = dataSize;
  AudioEqualizer_Init((float32_t)sampleRate);
  eqLimiterGain = 1.0f;
  AudioEcho_Init((float32_t)sampleRate);
  AudioReverb_Init((float32_t)sampleRate);
  AudioNoiseReduction_Init();
  printf("Calling BSP_AUDIO_OUT_Init with sampleRate=%lu\r\n", (unsigned long)sampleRate);
  audio_status = BSP_AUDIO_OUT_Init(
      OUTPUT_DEVICE_HEADPHONE,
      AudioVolume,
      sampleRate
  );
  if (audio_status != AUDIO_OK)
  {
    printf("BSP_AUDIO_OUT_Init failed, status=%u\r\n", audio_status);
    f_close(&WavFile);
    return 0;
  }
  BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_02);
  printf("Audio codec init OK\r\n");

  f_read(&WavFile, AudioBuffer, AUDIO_BUFFER_SIZE, &bytesread);
  if (bytesread < AUDIO_BUFFER_SIZE)
  {
    memset(&AudioBuffer[bytesread], 0, AUDIO_BUFFER_SIZE - bytesread);
  }
  AudioRemainingBytes -= bytesread;

  AudioEQ_Process(&AudioBuffer[0]);

  AudioEQ_Process(
      &AudioBuffer[AUDIO_HALF_BUFFER]
  );

  printf("Initial buffer filled, bytesread=%u\r\n", bytesread);

  AudioPlaying = 1;

  audio_status = BSP_AUDIO_OUT_Play((uint16_t *)AudioBuffer, AUDIO_BUFFER_SIZE);
  if (audio_status != AUDIO_OK)
  {
    printf("BSP_AUDIO_OUT_Play failed, status=%u\r\n", audio_status);
    BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
    AudioPlaying = 0;
    f_close(&WavFile);
    return 0;
  }
  printf("Playback started!\r\n");

  return 1;
}

static void AudioEQ_ApplyLimiter(void)
{
    float32_t peak = 0.0f;

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        float32_t leftPeak = fabsf(eqLeftBuffer[i]);
        float32_t rightPeak = fabsf(eqRightBuffer[i]);

        if (leftPeak > peak)
        {
            peak = leftPeak;
        }

        if (rightPeak > peak)
        {
            peak = rightPeak;
        }
    }

    float32_t targetGain = 1.0f;

    if (peak > EQ_LIMITER_THRESHOLD)
    {
        targetGain = EQ_LIMITER_THRESHOLD / peak;
    }

    if (targetGain < eqLimiterGain)
    {
        eqLimiterGain = targetGain;
    }
    else
    {
        eqLimiterGain +=
            EQ_LIMITER_RELEASE * (targetGain - eqLimiterGain);
    }

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        eqLeftBuffer[i] *= eqLimiterGain;
        eqRightBuffer[i] *= eqLimiterGain;
    }
}

void AudioNoiseReduction_SetEnabled(uint8_t enabled)
{
    uint8_t newState = enabled ? 1U : 0U;

    if (NoiseReductionEnabled != newState)
    {
        NoiseReductionEnabled = newState;
        noiseReductionResetPending = 1U;
    }
}

uint8_t AudioNoiseReduction_IsEnabled(void)
{
    return NoiseReductionEnabled;
}

static void AudioNoiseReduction_Reset(void)
{
    memset(&nrLeft, 0, sizeof(nrLeft));
    memset(&nrRight, 0, sizeof(nrRight));

    for (uint32_t k = 0U; k < NR_BIN_COUNT; k++)
    {
        nrLeft.previousGain[k] = 1.0f;
        nrRight.previousGain[k] = 1.0f;
    }
}

static void AudioNoiseReduction_Init(void)
{
    if (arm_rfft_fast_init_f32(
            &nrFftInstance,
            NR_FRAME_SIZE
        ) != ARM_MATH_SUCCESS)
    {
        Error_Handler();
    }

    for (uint32_t i = 0U; i < NR_FRAME_SIZE; i++)
    {
        /* Square-root Hann gives perfect 50% overlap reconstruction. */
        float32_t hann =
            0.5f -
            0.5f * cosf((2.0f * PI * i) / NR_FRAME_SIZE);
        nrWindow[i] = sqrtf(hann);
    }

    AudioNoiseReduction_Reset();
}

static void AudioNoiseReduction_ProcessChannel(
    NoiseReductionChannel *channel,
    float32_t *samples
)
{
    for (uint32_t offset = 0U;
         offset < EQ_BLOCK_SIZE;
         offset += NR_HOP_SIZE)
    {
        memmove(
            channel->inputFrame,
            &channel->inputFrame[NR_HOP_SIZE],
            NR_HOP_SIZE * sizeof(float32_t)
        );

        memcpy(
            &channel->inputFrame[NR_HOP_SIZE],
            &samples[offset],
            NR_HOP_SIZE * sizeof(float32_t)
        );

        for (uint32_t i = 0U; i < NR_FRAME_SIZE; i++)
        {
            nrFftInput[i] =
                channel->inputFrame[i] * nrWindow[i];
        }

        arm_rfft_fast_f32(
            &nrFftInstance,
            nrFftInput,
            nrFftOutput,
            0
        );

