alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
        /*
         * P[k] = Re(X[k])^2 + Im(X[k])^2
         * N[k] = beta*N[k] + (1-beta)*P[k]
         * G[k] = max(Gmin, 1 - alpha*N[k]/(P[k] + epsilon))
         * Y[k] = G[k] * X[k]
         */
        for (uint32_t k = 0U; k < NR_BIN_COUNT; k++)
        {
            float32_t real;
            float32_t imag = 0.0f;

            if (k == 0U)
            {
                real = nrFftOutput[0];
            }
            else if (k == NR_FRAME_SIZE / 2U)
            {
                real = nrFftOutput[1];
            }
            else
            {
                real = nrFftOutput[2U * k];
                imag = nrFftOutput[2U * k + 1U];
            }

            float32_t power = real * real + imag * imag;

            if (channel->initFrameCount < NR_INIT_FRAMES)
            {
                channel->noisePower[k] +=
                    power / (float32_t)NR_INIT_FRAMES;
                nrCurrentGain[k] = 1.0f;
            }
            else
            {
                float32_t noise = channel->noisePower[k];

                if (power < NR_NOISE_UPDATE_RATIO * noise)
                {
                    noise =
                        NR_NOISE_SMOOTHING * noise +
                        (1.0f - NR_NOISE_SMOOTHING) * power;
                    channel->noisePower[k] = noise;
                }

                float32_t gain =
                    1.0f -
                    NR_OVERSUBTRACTION * noise /
                    (power + NR_EPSILON);

                if (gain < NR_MIN_GAIN)
                {
                    gain = NR_MIN_GAIN;
                }
                else if (gain > 1.0f)
                {
                    gain = 1.0f;
                }

                nrCurrentGain[k] = gain;
            }
        }

        if (channel->initFrameCount < NR_INIT_FRAMES)
        {
            channel->initFrameCount++;
        }
        else
        {
            for (uint32_t k = 0U; k < NR_BIN_COUNT; k++)
            {
                uint32_t previousBin = (k > 0U) ? k - 1U : k;
                uint32_t nextBin =
                    (k + 1U < NR_BIN_COUNT) ? k + 1U : k;

                float32_t frequencySmoothedGain =
                    (
                        nrCurrentGain[previousBin] +
                        2.0f * nrCurrentGain[k] +
                        nrCurrentGain[nextBin]
                    ) * 0.25f;

                float32_t gain =
                    NR_GAIN_SMOOTHING * channel->previousGain[k] +
                    (1.0f - NR_GAIN_SMOOTHING) *
                    frequencySmoothedGain;

                channel->previousGain[k] = gain;

                if (k == 0U)
                {
                    nrFftOutput[0] *= gain;
                }
                else if (k == NR_FRAME_SIZE / 2U)
                {
                    nrFftOutput[1] *= gain;
                }
                else
                {
                    nrFftOutput[2U * k] *= gain;
                    nrFftOutput[2U * k + 1U] *= gain;
                }
            }
        }

        arm_rfft_fast_f32(
            &nrFftInstance,
            nrFftOutput,
            nrFftInput,
            1
        );

        for (uint32_t i = 0U; i < NR_FRAME_SIZE; i++)
        {
            channel->outputOverlap[i] +=
                nrFftInput[i] * nrWindow[i];
        }

        memcpy(
            &samples[offset],
            channel->outputOverlap,
            NR_HOP_SIZE * sizeof(float32_t)
        );

        memmove(
            channel->outputOverlap,
            &channel->outputOverlap[NR_HOP_SIZE],
            NR_HOP_SIZE * sizeof(float32_t)
        );

        memset(
            &channel->outputOverlap[NR_HOP_SIZE],
            0,
            NR_HOP_SIZE * sizeof(float32_t)
        );
    }
}

static void AudioNoiseReduction_Process(void)
{
    AudioNoiseReduction_ProcessChannel(
        &nrLeft,
        eqLeftBuffer
    );

    AudioNoiseReduction_ProcessChannel(
        &nrRight,
        eqRightBuffer
    );
}

void AudioEQ_Process(uint8_t *audioData)
{
    if (noiseReductionResetPending)
    {
        noiseReductionResetPending = 0U;
        AudioNoiseReduction_Reset();
    }

    if (!EQEnabled &&
        !AudioEcho_IsEnabled() &&
        !AudioReverb_IsEnabled() &&
        !NoiseReductionEnabled)
    {
        return;
    }

    int16_t *samples =
        (int16_t *)audioData;
    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        eqLeftBuffer[i] =
            (float32_t)samples[2 * i];

        eqRightBuffer[i] =
            (float32_t)samples[2 * i + 1];
    }

    if (NoiseReductionEnabled)
    {
        AudioNoiseReduction_Process();
    }

    if (EQEnabled)
    {
        AudioEqualizer_Process(
            eqLeftBuffer,
            eqRightBuffer,
            EQ_BLOCK_SIZE
        );
    }

    if (AudioEcho_IsEnabled())
    {
        AudioEcho_Process(
            eqLeftBuffer,
            eqRightBuffer,
            EQ_BLOCK_SIZE
        );
    }

    if (AudioReverb_IsEnabled())
    {
        AudioReverb_Process(
            eqLeftBuffer,
            eqRightBuffer,
            EQ_BLOCK_SIZE
        );
    }

    AudioEQ_ApplyLimiter();

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        float32_t left = eqLeftBuffer[i];
        float32_t right = eqRightBuffer[i];

        if (left > 32767.0f)
            left = 32767.0f;

        if (left < -32768.0f)
            left = -32768.0f;

        if (right > 32767.0f)
            right = 32767.0f;

        if (right < -32768.0f)
            right = -32768.0f;

        samples[2 * i] =
            (int16_t)left;

        samples[2 * i + 1] =
            (int16_t)right;
    }
}

void AudioFFT_Process(uint8_t *audioData)
{
    int16_t *samples = (int16_t *)audioData;

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        int32_t left  = samples[2 * i];
        int32_t right = samples[2 * i + 1];

        fftInput[i] = ((float32_t)left + (float32_t)right) * 0.5f;
    }

    float32_t mean = 0.0f;

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        mean += fftInput[i];
    }

    mean /= FFT_SIZE;

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        fftInput[i] -= mean;
    }

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        fftInput[i] *= hannWindow[i];
    }

    arm_rfft_fast_f32(
        &fftInstance,
        fftInput,
        fftOutput,
        0
    );

    fftMagnitude[0] = fabsf(fftOutput[0])/ FFT_SIZE;

    for (uint32_t k = 1; k < FFT_SIZE / 2; k++)
    {
        float32_t real = fftOutput[2 * k];
        float32_t imag = fftOutput[2 * k + 1];

        fftMagnitude[k] =
            sqrtf(real * real + imag * imag)/ FFT_SIZE;
    }

