alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
    uint32_t maxBin = 1;
    float32_t maxMagnitude = fftMagnitude[1];

    for (uint32_t k = 2; k < FFT_SIZE / 2; k++)
    {
        if (fftMagnitude[k] > maxMagnitude)
        {
            maxMagnitude = fftMagnitude[k];
            maxBin = k;
        }
    }
    static const uint16_t bandEdges[FFT_BANDS + 1] =
    {
        1,
        2,
        3,
        4,
        6,
        9,
        13,
        19,
        28,
        41,
        60,
        88,
        129,
        189,
        277,
        405,
        511
    };

    for (uint32_t band = 0; band < FFT_BANDS; band++)
    {
        float32_t sum = 0.0f;

        uint32_t startBin = bandEdges[band];
        uint32_t endBin   = bandEdges[band + 1];

        for (uint32_t k = startBin; k < endBin; k++)
        {
            sum += fftMagnitude[k];
        }

        uint32_t count = endBin - startBin;

        if (count > 0)
        {
            fftBands[band] = sum / (float32_t)count;
        }
        else
        {
            fftBands[band] = 0.0f;
        }
    }
    float32_t maxBand = 1.0f;

    for (uint32_t band = 0; band < FFT_BANDS; band++)
    {
        if (fftBands[band] > maxBand)
        {
            maxBand = fftBands[band];
        }
    }

    for (uint32_t band = 0; band < FFT_BANDS; band++)
    {
        float32_t normalized =
            (fftBands[band] / maxBand) * 100.0f;

        if (normalized > 100.0f)
        {
            normalized = 100.0f;
        }

        fftBandsSmoothed[band] =
            0.7f * fftBandsSmoothed[band] +
            0.3f * normalized;
    }

}

/* USER CODE END 4 */

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {

  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
